# задайте значение переменной b, чтобы результат был 2.5
a = 2
b = 0.5
print(a + b)  

# сделайте так, чтобы программа приветствовала вас, используя переменную name 
# и форматирование строк например "Привет, Миша!"
name = 'Александра'
print(f'Привет, {name}!')  

# поправьте код, чтобы выводилось число, на 10 больше, чем введённое
v = int(input('Введите число от 1 до 10: '))
print(v + 10) 


# поправьте код, чтобы выводилась строка Привет, ИМЯ! Как дела?
name = str(input('Введите ваше имя: '))
print(f'Привет, {name.upper()}! Как дела?')


#Выведите на экран при помощи print() результат работы:
print(float('1'))
#print(int('2.5')) выдает ошибку
print(bool(1))
print(bool(''))
print(bool(0))
